







# Задача 5
# Напишите программу, которая выводит чётные числа из списка длиною 300 объектов
#    и останавливается, если встречает число 237.

p = 237
for i in range(300):
    if i <= p :
        if i % 2:
            pass
            print(i, end = " ")









'''
# Задание 6:

numbers = [0,2,4,7,1,8,0,-3,7,0,-2,4,0,0,-1,7,-43,0,8,-3,6,9]

list2=[]
for i in numbers:
    if i <0:
        list2.append(-1)
    elif i >0:
        list2.append(1)
    else:
        list2.append(0)
print(list2) 

'''