
name = input( "Привет друг как тебя зовут?")

print( "Приятно познакомиться " + name + "!!!")

age  = input( "Сколько тебе лет?  \n ")

print( "Ого, тебе уже " + age + ", это круто!!! =D")

profi = input("Кем ты хочешь стать?:  \n ")

print("Тебе нравиться быть " + profi + "?")

otvet = input()

print(otvet +"? " " Отлично!!!")

pens = input("Сколько лет ты хочешь работать " + profi + "?  =) : \n ")

c = int(pens) + int(age)

print("Значит в " + str(c) + " лет ты ухожишь на пенсию?  Х)")

input()
i = input("Ты раньше об этом думал? \n ")
print("Понятно)\nСпасибо что уделил внимание")

